---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizeIterator.MoveNext
source: html/7fa204bb-df36-2a86-951d-422ce66e3fc3.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizeIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this iterator.
 False if the iterator has completed all available items.